------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /misc/utopia3/bjb40/lanhome/projects/rel_belong/output/mnl_log.txt
  log type:  text
 opened on:   6 Sep 2015, 18:16:32

. 
. 
. *code age squared
. gen age2 = age*age

. gen femalexage = female*age

. gen whitexage = white*age

. 
. *basic models
. mlogit nstate reltrad2 reltrad3 reltrad4 reltrad5  

Iteration 0:   log likelihood = -12943.688  
Iteration 1:   log likelihood = -7717.6316  
Iteration 2:   log likelihood = -6904.6379  (backed up)
Iteration 3:   log likelihood = -6677.1601  
Iteration 4:   log likelihood = -6403.0848  
Iteration 5:   log likelihood = -6124.8775  
Iteration 6:   log likelihood = -6119.7964  
Iteration 7:   log likelihood = -6119.6076  
Iteration 8:   log likelihood = -6119.6073  

Multinomial logistic regression                   Number of obs   =       8422
                                                  LR chi2(20)     =   13648.16
                                                  Prob > chi2     =     0.0000
Log likelihood = -6119.6073                       Pseudo R2       =     0.5272

------------------------------------------------------------------------------
      nstate |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1            |  (base outcome)
-------------+----------------------------------------------------------------
2            |
    reltrad2 |   4.334968   .1111322    39.01   0.000     4.117153    4.552783
    reltrad3 |   1.229586   .3570794     3.44   0.001     .5297228    1.929448
    reltrad4 |   1.940751   .2398713     8.09   0.000     1.470612     2.41089
    reltrad5 |   1.422836    .184136     7.73   0.000     1.061936    1.783736
       _cons |  -2.798201   .0816851   -34.26   0.000    -2.958301   -2.638102
-------------+----------------------------------------------------------------
3            |
    reltrad2 |   .6553058   .3656647     1.79   0.073    -.0613839    1.371995
    reltrad3 |   6.021278     .20267    29.71   0.000     5.624052    6.418504
    reltrad4 |   2.119306   .3411918     6.21   0.000     1.450582     2.78803
    reltrad5 |   2.809703   .1964001    14.31   0.000     2.424765     3.19464
       _cons |  -3.824054   .1338918   -28.56   0.000    -4.086477   -3.561631
-------------+----------------------------------------------------------------
4            |
    reltrad2 |   1.787364   .2590961     6.90   0.000     1.279545    2.295183
    reltrad3 |   1.895844   .4563892     4.15   0.000     1.001337     2.79035
    reltrad4 |    7.22519   .1911292    37.80   0.000     6.850583    7.599796
    reltrad5 |   3.075344   .1994977    15.42   0.000     2.684335    3.466352
       _cons |  -3.975285   .1441919   -27.57   0.000    -4.257896   -3.692674
-------------+----------------------------------------------------------------
5            |
    reltrad2 |   1.286686    .166758     7.72   0.000     .9598463    1.613526
    reltrad3 |   3.260197   .1931175    16.88   0.000     2.881693      3.6387
    reltrad4 |   2.994666   .1762165    16.99   0.000     2.649288    3.340044
    reltrad5 |   4.381017   .1096383    39.96   0.000      4.16613    4.595904
       _cons |   -2.60961   .0747762   -34.90   0.000    -2.756169   -2.463052
-------------+----------------------------------------------------------------
6            |
    reltrad2 |   1.556668   .2668213     5.83   0.000     1.033708    2.079628
    reltrad3 |   2.309505   .3738114     6.18   0.000     1.576848    3.042162
    reltrad4 |   2.823961   .2784447    10.14   0.000      2.27822    3.369703
    reltrad5 |   1.507328   .2884782     5.23   0.000     .9419215    2.072735
       _cons |  -3.878121   .1374833   -28.21   0.000    -4.147584   -3.608659
------------------------------------------------------------------------------

. estat ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |    Obs    ll(null)   ll(model)     df          AIC         BIC
-------------+---------------------------------------------------------------
           . |   8422   -12943.69   -6119.607     25     12289.21    12465.18
-----------------------------------------------------------------------------
               Note:  N=Obs used in calculating BIC; see [R] BIC note

. 
. mlogit nstate reltrad2 reltrad3 reltrad4 reltrad5 female married white age

Iteration 0:   log likelihood = -12943.688  
Iteration 1:   log likelihood = -7482.1888  
Iteration 2:   log likelihood = -6696.6258  (backed up)
Iteration 3:   log likelihood = -6404.3673  
Iteration 4:   log likelihood = -6159.9371  
Iteration 5:   log likelihood = -5927.6569  
Iteration 6:   log likelihood = -5924.4056  
Iteration 7:   log likelihood = -5924.3425  
Iteration 8:   log likelihood = -5924.3424  

Multinomial logistic regression                   Number of obs   =       8422
                                                  LR chi2(40)     =   14038.69
                                                  Prob > chi2     =     0.0000
Log likelihood = -5924.3424                       Pseudo R2       =     0.5423

------------------------------------------------------------------------------
      nstate |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1            |  (base outcome)
-------------+----------------------------------------------------------------
2            |
    reltrad2 |   4.205593    .112193    37.49   0.000     3.985699    4.425487
    reltrad3 |   1.223256   .3579123     3.42   0.001      .521761    1.924752
    reltrad4 |   1.901443   .2409727     7.89   0.000     1.429145    2.373741
    reltrad5 |   1.454032   .1856489     7.83   0.000     1.090166    1.817897
      female |   .1250662   .0990446     1.26   0.207    -.0690576      .31919
     married |   .0852921     .09834     0.87   0.386    -.1074509     .278035
       white |   .4099217   .1297174     3.16   0.002     .1556802    .6641632
         age |    .015636   .0029459     5.31   0.000     .0098621    .0214099
       _cons |  -4.003072   .2075635   -19.29   0.000    -4.409889   -3.596254
-------------+----------------------------------------------------------------
3            |
    reltrad2 |   .6364407   .3668302     1.73   0.083    -.0825333    1.355415
    reltrad3 |    6.03373   .2033927    29.67   0.000     5.635087    6.432372
    reltrad4 |   2.126993   .3416431     6.23   0.000     1.457384    2.796601
    reltrad5 |   2.857276   .1982336    14.41   0.000     2.468745    3.245807
      female |   .1193272   .1356616     0.88   0.379    -.1465646    .3852191
     married |   .2753114   .1359768     2.02   0.043     .0088017     .541821
       white |  -.1058622   .1567388    -0.68   0.499    -.4130645    .2013402
         age |   .0047387   .0041981     1.13   0.259    -.0034894    .0129669
       _cons |  -4.193752   .2743814   -15.28   0.000    -4.731529   -3.655974
-------------+----------------------------------------------------------------
4            |
    reltrad2 |   1.753097   .2602102     6.74   0.000     1.243094    2.263099
    reltrad3 |   1.895612   .4565039     4.15   0.000     1.000881    2.790344
    reltrad4 |   7.214402   .1914293    37.69   0.000     6.839207    7.589597
    reltrad5 |    3.08238   .2006831    15.36   0.000     2.689048    3.475711
      female |   .0429305   .1197229     0.36   0.720     -.191722     .277583
     married |   .0888024   .1201764     0.74   0.460     -.146739    .3243438
       white |   .1276687   .1481829     0.86   0.389    -.1627644    .4181018
         age |   .0026725   .0036343     0.74   0.462    -.0044506    .0097956
       _cons |  -4.264315   .2523726   -16.90   0.000    -4.758957   -3.769674
-------------+----------------------------------------------------------------
5            |
    reltrad2 |   1.301384   .1684753     7.72   0.000     .9711783    1.631589
    reltrad3 |   3.218264    .194498    16.55   0.000     2.837055    3.599474
    reltrad4 |   2.944917   .1775511    16.59   0.000     2.596924    3.292911
    reltrad5 |   4.260568   .1103225    38.62   0.000      4.04434    4.476796
      female |  -.3630957   .0889651    -4.08   0.000    -.5374642   -.1887273
     married |  -.2198619   .0906612    -2.43   0.015    -.3975545   -.0421692
       white |   .4368254    .109633     3.98   0.000     .2219487     .651702
         age |  -.0153214   .0028189    -5.44   0.000    -.0208464   -.0097964
       _cons |  -1.918478   .1689505   -11.36   0.000    -2.249615   -1.587341
-------------+----------------------------------------------------------------
6            |
    reltrad2 |   1.297135    .279398     4.64   0.000     .7495247    1.844745
    reltrad3 |   2.361323   .3870994     6.10   0.000     1.602622    3.120024
    reltrad4 |   2.802143   .2963151     9.46   0.000     2.221376     3.38291
    reltrad5 |   1.705346   .3026561     5.63   0.000     1.112151    2.298541
      female |  -.8135452   .1973136    -4.12   0.000    -1.200273   -.4268177
     married |  -.7324957   .2104318    -3.48   0.000    -1.144934   -.3200569
       white |  -.5733292   .2172159    -2.64   0.008    -.9990646   -.1475939
         age |   .0825665   .0066834    12.35   0.000     .0694673    .0956657
       _cons |  -7.620732   .4785557   -15.92   0.000    -8.558684    -6.68278
------------------------------------------------------------------------------

. estat ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |    Obs    ll(null)   ll(model)     df          AIC         BIC
-------------+---------------------------------------------------------------
           . |   8422   -12943.69   -5924.342     45     11938.68    12255.42
-----------------------------------------------------------------------------
               Note:  N=Obs used in calculating BIC; see [R] BIC note

. 
. mlogit nstate reltrad2 reltrad3 reltrad4 reltrad5 female married white age age2

Iteration 0:   log likelihood = -12943.688  
Iteration 1:   log likelihood = -7602.2363  
Iteration 2:   log likelihood = -6839.5277  (backed up)
Iteration 3:   log likelihood = -6503.6252  
Iteration 4:   log likelihood = -6162.1528  
Iteration 5:   log likelihood = -5923.6254  
Iteration 6:   log likelihood = -5920.2161  
Iteration 7:   log likelihood = -5920.1625  
Iteration 8:   log likelihood = -5920.1624  

Multinomial logistic regression                   Number of obs   =       8422
                                                  LR chi2(45)     =   14047.05
                                                  Prob > chi2     =     0.0000
Log likelihood = -5920.1624                       Pseudo R2       =     0.5426

------------------------------------------------------------------------------
      nstate |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1            |  (base outcome)
-------------+----------------------------------------------------------------
2            |
    reltrad2 |   4.204361   .1121982    37.47   0.000     3.984457    4.424266
    reltrad3 |   1.221239   .3579483     3.41   0.001     .5196735    1.922805
    reltrad4 |   1.900052   .2409427     7.89   0.000     1.427813    2.372291
    reltrad5 |   1.452324   .1856502     7.82   0.000     1.088456    1.816192
      female |   .1221641   .0991665     1.23   0.218    -.0721987    .3165268
     married |   .0946699   .1002241     0.94   0.345    -.1017657    .2911054
       white |   .4073315   .1297685     3.14   0.002     .1529899    .6616732
         age |   .0070059   .0169529     0.41   0.679    -.0262212     .040233
        age2 |    .000085   .0001577     0.54   0.590     -.000224     .000394
       _cons |  -3.807372   .4454932    -8.55   0.000    -4.680523   -2.934222
-------------+----------------------------------------------------------------
3            |
    reltrad2 |   .6367879   .3668787     1.74   0.083    -.0822811    1.355857
    reltrad3 |   6.033383   .2034285    29.66   0.000      5.63467    6.432095
    reltrad4 |   2.125971   .3417008     6.22   0.000      1.45625    2.795693
    reltrad5 |    2.85658   .1982532    14.41   0.000     2.468011    3.245149
      female |   .1200293   .1362024     0.88   0.378    -.1469225     .386981
     married |   .2799007   .1386648     2.02   0.044     .0081226    .5516787
       white |  -.1084453   .1568738    -0.69   0.489    -.4159123    .1990217
         age |   .0015945    .023297     0.07   0.945    -.0440668    .0472557
        age2 |   .0000303   .0002284     0.13   0.894    -.0004173     .000478
       _cons |  -4.121292   .5809962    -7.09   0.000    -5.260024    -2.98256
-------------+----------------------------------------------------------------
4            |
    reltrad2 |   1.747791   .2603188     6.71   0.000     1.237576    2.258007
    reltrad3 |   1.891696   .4565335     4.14   0.000     .9969063    2.786485
    reltrad4 |   7.207746   .1914522    37.65   0.000     6.832507    7.582986
    reltrad5 |   3.078759   .2006991    15.34   0.000     2.685396    3.472122
      female |   .0356977   .1198298     0.30   0.766    -.1991644    .2705599
     married |   .1207287   .1232154     0.98   0.327    -.1207689    .3622264
       white |   .1246668   .1483456     0.84   0.401    -.1660853    .4154188
         age |  -.0204111   .0197332    -1.03   0.301    -.0590876    .0182653
        age2 |   .0002276   .0001914     1.19   0.234    -.0001475    .0006027
       _cons |  -3.749419   .4944736    -7.58   0.000    -4.718569   -2.780268
-------------+----------------------------------------------------------------
5            |
    reltrad2 |   1.300996   .1685211     7.72   0.000      .970701    1.631291
    reltrad3 |   3.217293   .1945474    16.54   0.000     2.835987    3.598598
    reltrad4 |   2.945166   .1776021    16.58   0.000     2.597072    3.293259
    reltrad5 |   4.259855   .1103383    38.61   0.000     4.043596    4.476114
      female |  -.3672039   .0891667    -4.12   0.000    -.5419673   -.1924404
     married |  -.2082884   .0924171    -2.25   0.024    -.3894227   -.0271542
       white |   .4325388   .1097019     3.94   0.000      .217527    .6475505
         age |   -.024827   .0156147    -1.59   0.112    -.0554313    .0057772
        age2 |    .000094   .0001578     0.60   0.551    -.0002152    .0004032
       _cons |  -1.703935   .3700693    -4.60   0.000    -2.429257   -.9786121
-------------+----------------------------------------------------------------
6            |
    reltrad2 |   1.278443    .283625     4.51   0.000     .7225478    1.834337
    reltrad3 |   2.364248   .3916845     6.04   0.000     1.596561    3.131936
    reltrad4 |   2.816219   .3011636     9.35   0.000     2.225949    3.406488
    reltrad5 |   1.722812   .3050601     5.65   0.000     1.124905    2.320719
      female |  -.8534777   .1997628    -4.27   0.000    -1.245006   -.4619498
     married |  -.6618046   .2138458    -3.09   0.002    -1.080935   -.2426746
       white |  -.5761213   .2191072    -2.63   0.009    -1.005563   -.1466792
         age |  -.0252212    .036942    -0.68   0.495    -.0976261    .0471837
        age2 |   .0008789   .0003009     2.92   0.003     .0002891    .0014687
       _cons |  -4.555926   1.099489    -4.14   0.000    -6.710884   -2.400968
------------------------------------------------------------------------------

. estat ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |    Obs    ll(null)   ll(model)     df          AIC         BIC
-------------+---------------------------------------------------------------
           . |   8422   -12943.69   -5920.162     50     11940.32    12292.25
-----------------------------------------------------------------------------
               Note:  N=Obs used in calculating BIC; see [R] BIC note

. 
. 
. *interaction models
. mlogit nstate reltrad2 reltrad3 reltrad4 reltrad5 female femalexage married ///
>         white whitexage age

Iteration 0:   log likelihood = -12943.688  
Iteration 1:   log likelihood = -7500.1172  
Iteration 2:   log likelihood = -6719.8452  (backed up)
Iteration 3:   log likelihood = -6415.8273  
Iteration 4:   log likelihood = -6158.1624  
Iteration 5:   log likelihood = -5926.0128  
Iteration 6:   log likelihood = -5922.7068  
Iteration 7:   log likelihood = -5922.6465  
Iteration 8:   log likelihood = -5922.6464  

Multinomial logistic regression                   Number of obs   =       8422
                                                  LR chi2(50)     =   14042.08
                                                  Prob > chi2     =     0.0000
Log likelihood = -5922.6464                       Pseudo R2       =     0.5424

------------------------------------------------------------------------------
      nstate |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1            |  (base outcome)
-------------+----------------------------------------------------------------
2            |
    reltrad2 |    4.20497   .1122164    37.47   0.000     3.985029     4.42491
    reltrad3 |   1.212647   .3580805     3.39   0.001      .510822    1.914472
    reltrad4 |   1.897244   .2409691     7.87   0.000     1.424953    2.369534
    reltrad5 |   1.452293   .1856805     7.82   0.000     1.088366     1.81622
      female |  -.1520169   .3279592    -0.46   0.643    -.7948052    .4907714
  femalexage |   .0053343   .0059907     0.89   0.373    -.0064073    .0170758
     married |   .0992878   .0992969     1.00   0.317    -.0953306    .2939061
       white |   .1228066   .4028975     0.30   0.761     -.666858    .9124712
   whitexage |   .0058097   .0077123     0.75   0.451    -.0093061    .0209255
         age |   .0075939   .0080666     0.94   0.346    -.0082163    .0234041
       _cons |  -3.607393   .4230207    -8.53   0.000    -4.436498   -2.778287
-------------+----------------------------------------------------------------
3            |
    reltrad2 |   .6381331   .3668472     1.74   0.082    -.0808742     1.35714
    reltrad3 |    6.03686    .203689    29.64   0.000     5.637637    6.436083
    reltrad4 |   2.130023    .341797     6.23   0.000     1.460113    2.799932
    reltrad5 |   2.856946   .1984694    14.39   0.000     2.467953    3.245939
      female |   .2525527   .4232357     0.60   0.551    -.5769741    1.082079
  femalexage |  -.0028121   .0083488    -0.34   0.736    -.0191755    .0135512
     married |   .2680462   .1369953     1.96   0.050    -.0004595     .536552
       white |  -.0723898   .4671911    -0.15   0.877    -.9880675    .8432879
   whitexage |  -.0008082   .0097336    -0.08   0.934    -.0198856    .0182693
         age |   .0070819   .0098967     0.72   0.474    -.0123153     .026479
       _cons |  -4.298599   .4917813    -8.74   0.000    -5.262472   -3.334725
-------------+----------------------------------------------------------------
4            |
    reltrad2 |   1.748312   .2602868     6.72   0.000     1.238159    2.258465
    reltrad3 |   1.884305    .456613     4.13   0.000     .9893599     2.77925
    reltrad4 |    7.20437   .1915175    37.62   0.000     6.829003    7.579738
    reltrad5 |    3.08017   .2008131    15.34   0.000     2.686584    3.473757
      female |  -.2814559   .3564512    -0.79   0.430    -.9800873    .4171756
  femalexage |   .0067249   .0069525     0.97   0.333    -.0069017    .0203516
     married |   .1051323   .1210368     0.87   0.385    -.1320955    .3423602
       white |  -.1813942   .4146714    -0.44   0.662    -.9941351    .6313468
   whitexage |   .0068309   .0087252     0.78   0.434    -.0102701    .0239319
         age |  -.0067111   .0089424    -0.75   0.453     -.024238    .0108157
       _cons |   -3.83904    .441823    -8.69   0.000    -4.704997   -2.973083
-------------+----------------------------------------------------------------
5            |
    reltrad2 |   1.300085     .16851     7.72   0.000     .9698116    1.630359
    reltrad3 |   3.214237   .1946179    16.52   0.000     2.832793    3.595681
    reltrad4 |   2.941625   .1776444    16.56   0.000     2.593448    3.289801
    reltrad5 |   4.257092   .1104623    38.54   0.000      4.04059    4.473594
      female |   -.404179   .2682354    -1.51   0.132    -.9299108    .1215529
  femalexage |   .0007309   .0055349     0.13   0.895    -.0101173    .0115792
     married |  -.2157235   .0911125    -2.37   0.018    -.3943008   -.0371462
       white |   .2085357    .321407     0.65   0.516    -.4214105    .8384819
   whitexage |   .0053008   .0072124     0.73   0.462    -.0088354    .0194369
         age |  -.0201278   .0072696    -2.77   0.006     -.034376   -.0058796
       _cons |  -1.711045   .3288419    -5.20   0.000    -2.355563   -1.066526
-------------+----------------------------------------------------------------
6            |
    reltrad2 |   1.279019   .2794062     4.58   0.000     .7313933    1.826646
    reltrad3 |   2.340048   .3881279     6.03   0.000     1.579332    3.100765
    reltrad4 |   2.775317   .2969225     9.35   0.000      2.19336    3.357275
    reltrad5 |    1.69775   .3023958     5.61   0.000     1.105065    2.290435
      female |  -1.305741   .9202612    -1.42   0.156     -3.10942    .4979374
  femalexage |   .0078211   .0132668     0.59   0.556    -.0181814    .0338235
     married |  -.7161296   .2124165    -3.37   0.001    -1.132458   -.2998009
       white |  -.8733659   .9349251    -0.93   0.350    -2.705785    .9590536
   whitexage |   .0052678    .013896     0.38   0.705     -.021968    .0325035
         age |   .0748342   .0130169     5.75   0.000     .0493215    .1003469
       _cons |  -7.170619   .8535122    -8.40   0.000    -8.843472   -5.497766
------------------------------------------------------------------------------

. estat ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |    Obs    ll(null)   ll(model)     df          AIC         BIC
-------------+---------------------------------------------------------------
           . |   8422   -12943.69   -5922.646     55     11955.29    12342.42
-----------------------------------------------------------------------------
               Note:  N=Obs used in calculating BIC; see [R] BIC note

. 
end of do-file

